Revit 2027 API
ToposolidType.SetContourSettting Method
 Set the contour setting for the current toposolid type by copying from an existing contour setting object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetContourSettting(
	ContourSetting setting
)
Public Sub SetContourSettting (
	setting As ContourSetting
)
public:
void SetContourSettting(
	ContourSetting^ setting
)
member SetContourSettting :
        setting : ContourSetting -> unit
Parameters
setting ContourSetting
 An existing contour setting object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ToposolidType Class
Autodesk.Revit.DB Namespace